artillery/load-suite.yml
config:
  target: "https://opensource-demo.orangehrmlive.com"
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 2
  engines:
    playwright: {}
  processor: "./load-suite.js"

scenarios:
  - name: "TC-AUTH-LOGIN-001 - valid credentials login flow"
    engine: playwright
    testFunction: loginValidCredentialsFlow
    weight: 1

  - name: "TC-AUTH-LOGIN-002 - invalid password flow"
    engine: playwright
    testFunction: invalidPasswordFlow
    weight: 1

  - name: "TC-DASH-HOME-001 - dashboard load flow"
    engine: playwright
    testFunction: dashboardLoadFlow
    weight: 1

  - name: "TC-PIM-EMPLIST-001 - employee list load flow"
    engine: playwright
    testFunction: employeeListLoadFlow
    weight: 1