artillery/orangehrm-load.yml
config:
  target: "https://opensource-demo.orangehrmlive.com"
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 2
  engines:
    playwright: {}
  processor: "./orangehrm-load.js"

scenarios:
  - name: OrangeHRM admin login + dashboard + Pim flow
    engine: playwright
    testFunction: orangeHrmAdminFlow