artillery/quick-smoke.yml
config:
  target: "https://opensource-demo.orangehrmlive.com"
  plugins:
    ensure: {}
  phases:
    - name: "Quick smoke validation"
      duration: 10
      arrivalRate: 1
      rampTo: 2
  ensure:
    thresholds:
      - "http.response_time.p95": 2000
  engines:
    playwright: {}
  processor: "./quick-smoke.js"

scenarios:
  - name: "Quick smoke: login + dashboard + PIM"
    engine: playwright
    testFunction: quickSmokeFlow